app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches"
---
  def index
    @matches = Match.all #Match.all x MODEL CLASS. action, STORED IN @MATCHES INSTANCE VARIABLE

INSERT INTO "matches" ("Title", "Body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Title", "mr sexy"], ["Body", "cute, endearing, empathetic, great communicator."], ["created_at", 2017-04-05 20:50:00 UTC], ["updated_at", 2017-04-05 20:50:00 UTC]]
---
  def create
    @match = Match.new(match_params)

    respond_to do |format|
      if @match.save

UPDATE "matches" SET "Body" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["Body", "hi nice to see you"], ["updated_at", 2017-04-06 09:48:52 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @match.update(match_params)

SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_match
      @match = Match.find(params[:id])